package myhomework.OOP;

/**
 * Статические поля и методы.
 * Создайте класс MyMath.
 * Создайте 4 статических метода в нём, которые будут возвращать соответствующие значения:
 * add (сложение), sub (вычитание), mult (умножение) и div (деления).
 * Проверьте все 4 метода, выводя результат их работы в консоль.
 * Добавьте статическое private-поле в класс MyMath, в котором будет храниться количество вызовов статических методов.
 * Инкрементируйте статическое поле при каждом вызове метода.
 * Создайте статический метод get для этого счётчика.
 * Выведите в основной программе значение этого счётчика до вызова статических методов и после.
 */

public class MyMath {

}
