package myhomework.base;

import javax.swing.*;

/**
 * Урок 1. Hello World
 * Выведите в консоль сообщение: «Привет, мир!».
 */

public class Lesson1 {
    public static void main(String[] args) {
        System.out.println("Привет, мир!");
    }
}
