package simplejava.Classwork07;

import java.util.Scanner;

/**
 * Задание 2
 * Пользователь вводит с клавиатуры строку и слово для поиска. Посчитайте сколько раз
 * в строке встречается искомое слово. Полученное число выведите на экран.
 */

public class Task02 {
    public static void main(String[] args) {
        Scanner q = new Scanner(System.in);
        System.out.println("Введите строку");
        String str = q.next();
        System.out.println("Введите слово для поиска");
        String word = q.next();



    }
}
