package simplejava.Dz1;

/**
 * Задание 4
 * Написать программу, которая выведет на консоль «Hello
 * world», не используя в исходном коде пробельных символов.
 */

public class Task4 {
    public static void main(String[] args) {
        String x = "Hello";
        String y = "world";
        char z =32;
        System.out.println(x + z + y);
    }
}
